tap "azure/kubelogin"
tap "bridgecrewio/tap"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "pulumi/tap"
tap "updatecli/updatecli"

brew "ansible"
brew "argocd"
brew "asdf"
brew "azure-cli"
brew "base64"
brew "bash"
brew "commitlint"
brew "commitizen"
brew "cookiecutter"
brew "direnv"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "git-cliff"
brew "gitleaks"
brew "gnu-tar"
brew "graphviz"
brew "jq"
brew "mas"
brew "nmap"
brew "pre-commit"
brew "sevenzip"
brew "shellcheck"
brew "starship"
brew "thefuck"
brew "tree"
brew "watch"
brew "yq"
brew "zsh-syntax-highlighting"

cask "appcleaner"
cask "bitwarden"
cask "brave-browser"
cask "cold-turkey-blocker"
cask "docker"
cask "flux"
cask "font-fira-code-nerd-font"
cask "keyboardcleantool"
cask "slack"
cask "tempbox"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "vivaldi"
cask "warp"

mas "reMarkable", id: 1276493162

vscode "ms-vscode-remote.remote-containers"
vscode "eamodio.gitlens"
vscode "hashicorp.terraform"
vscode "foxundermoon.shell-format"
vscode "gruntfuggly.todo-tree"
vscode "humao.rest-client"
vscode "jebbs.plantuml"
vscode "yzhang.markdown-all-in-one"
vscode "piotrpalarz.vscode-gitignore-generator"
vscode "zhuangtongfa.material-theme"
